# NewActiveView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewActivatingEventArgs..::..NewActiveView Property
ViewActivatingEventArgs Class See Also
---
The view that is going to become active.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public View NewActiveView { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NewActiveView As View
	Get
```

Visual C++
---
```text
public:
property View^ NewActiveView {
	View^ get ();
}
```

# See Also
ViewActivatingEventArgs Class
Autodesk.Revit.UI.Events Namespace